HloModule jit_wrapped, is_scheduled=true, entry_computation_layout={(f32[16,128,64,128]{3,2,1,0:T(8,128)}, f32[16,128,64,128]{3,2,1,0:T(8,128)}, f32[16,128,64,128]{3,2,1,0:T(8,128)}, f32[16,128,64,128]{3,2,1,0:T(8,128)}, f32[16,128,128,128]{3,2,1,0:T(8,128)}, /*index=5*/f32[16,128,64,128]{3,2,1,0:T(8,128)}, f32[16,128,128,128]{3,2,1,0:T(8,128)})->(f32[16,128,64,128]{3,2,1,0:T(8,128)}, f32[16,128,64,128]{3,2,1,0:T(8,128)}, f32[16,128,64,128]{3,2,1,0:T(8,128)}, f32[16,128,64,128]{3,2,1,0:T(8,128)})}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true,true,true}

FileNames
1 "/workspace/kernel-evolve/docker/evaluate.py"
2 "<string>"

FunctionNames
1 "stage_performance"
2 "optimized_compute"
3 "optimized_compute.<locals>.loss_fn"
4 "chunk_gla"
5 "<module>"
6 "main"

FileLocations
1 {file_name_id=1 function_name_id=1 line=120 end_line=120 column=12 end_column=30}
2 {file_name_id=2 function_name_id=2 line=577 end_line=577 column=14 end_column=73}
3 {file_name_id=2 function_name_id=3 line=574 end_line=575 column=15 end_column=74}
4 {file_name_id=2 function_name_id=4 line=556 end_line=556 column=11 end_column=28}
5 {file_name_id=1 function_name_id=5 line=870 end_line=870 column=4 end_column=10}
6 {file_name_id=1 function_name_id=6 line=749 end_line=749 column=16 end_column=79}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=2}
3 {file_location_id=3 parent_frame_id=3}
4 {file_location_id=4 parent_frame_id=4}
5 {file_location_id=5 parent_frame_id=5}
6 {file_location_id=6 parent_frame_id=6}
7 {file_location_id=1 parent_frame_id=7}
8 {file_location_id=2 parent_frame_id=8}
9 {file_location_id=3 parent_frame_id=9}
10 {file_location_id=4 parent_frame_id=10}


ENTRY %main.1 (args_0_.1: f32[16,128,64,128], args_1_.1: f32[16,128,64,128], args_2_.1: f32[16,128,64,128], args_3_.1: f32[16,128,64,128], args_4_.1: f32[16,128,128,128], args_5_.1: f32[16,128,64,128], args_6_.1: f32[16,128,128,128]) -> (f32[16,128,64,128], f32[16,128,64,128], f32[16,128,64,128], f32[16,128,64,128]) {
  %args_6_.1 = f32[16,128,128,128]{3,2,1,0:T(8,128)} parameter(6), metadata={op_name="args[6]"}, backend_config={"flag_configs":[],"scoped_memory_configs":[{"memory_space":"1","offset":"0","size":"0"}],"used_scoped_memory_configs":[]}
  %args_5_.1 = f32[16,128,64,128]{3,2,1,0:T(8,128)} parameter(5), metadata={op_name="args[5]"}, backend_config={"flag_configs":[],"scoped_memory_configs":[{"memory_space":"1","offset":"0","size":"0"}],"used_scoped_memory_configs":[]}
  %args_4_.1 = f32[16,128,128,128]{3,2,1,0:T(8,128)} parameter(4), metadata={op_name="args[4]"}, backend_config={"flag_configs":[],"scoped_memory_configs":[{"memory_space":"1","offset":"0","size":"0"}],"used_scoped_memory_configs":[]}
  %args_3_.1 = f32[16,128,64,128]{3,2,1,0:T(8,128)} parameter(3), metadata={op_name="args[3]"}, backend_config={"flag_configs":[],"scoped_memory_configs":[{"memory_space":"1","offset":"0","size":"0"}],"used_scoped_memory_configs":[]}
  %args_2_.1 = f32[16,128,64,128]{3,2,1,0:T(8,128)} parameter(2), metadata={op_name="args[2]"}, backend_config={"flag_configs":[],"scoped_memory_configs":[{"memory_space":"1","offset":"0","size":"0"}],"used_scoped_memory_configs":[]}
  %args_1_.1 = f32[16,128,64,128]{3,2,1,0:T(8,128)} parameter(1), metadata={op_name="args[1]"}, backend_config={"flag_configs":[],"scoped_memory_configs":[{"memory_space":"1","offset":"0","size":"0"}],"used_scoped_memory_configs":[]}
  %args_0_.1 = f32[16,128,64,128]{3,2,1,0:T(8,128)} parameter(0), metadata={op_name="args[0]"}, backend_config={"flag_configs":[],"scoped_memory_configs":[{"memory_space":"1","offset":"0","size":"0"}],"used_scoped_memory_configs":[]}
  ROOT %tpu_custom_call.1 = (f32[16,128,64,128]{3,2,1,0:T(8,128)}, f32[16,128,64,128]{3,2,1,0:T(8,128)}, f32[16,128,64,128]{3,2,1,0:T(8,128)}, f32[16,128,64,128]{3,2,1,0:T(8,128)}) custom-call(%args_0_.1, %args_1_.1, %args_2_.1, %args_3_.1, %args_4_.1, /*index=5*/%args_5_.1, %args_6_.1), custom_call_target="tpu_custom_call", operand_layout_constraints={f32[16,128,64,128]{3,2,1,0}, f32[16,128,64,128]{3,2,1,0}, f32[16,128,64,128]{3,2,1,0}, f32[16,128,64,128]{3,2,1,0}, f32[16,128,128,128]{3,2,1,0}, f32[16,128,64,128]{3,2,1,0}, f32[16,128,128,128]{3,2,1,0}}, frontend_attributes={kernel_metadata={}}, metadata={op_name="jit(wrapped)/pallas_call" stack_frame_id=10}, backend_config={"flag_configs":[],"scoped_memory_configs":[{"memory_space":"1","offset":"0","size":"33554432"}],"custom_call_config":{"body":"TUzvUgFNTElSMjMuMC4wZ2l0AAE7CwEDBQcJAQMLAyUNDxETFRcZGx0fISMlJykrLS8DTgSuAy0B+QcTDxMXGxcXEwsLCwsLk0MLFxMbFxcXCxcXFxsXFxMvFw8LDxcXDxcXxQsLCwsLkwsLCwsLCw8XFwsXCwsLFxsTCxcLCxMLD0sLEwsLUwsLCwsLNxsLGwsbCxsLGwsbCxsLGwsbCxsLGwsbGxsbGxsbGxsbGw8PCw8LCx8FB5FhTQkDSQHREwsnEwsfFxcLGxMTHwsfNwsXDwsXExMXCxMLCxMLCwsTCw8LEwsPCxMLCxMLC1MLEwsfCxMLCwsLCx8LIwsTCwsTCwsPCxMLDxMTFxcLGxMTJwsTCx8LDwsTCwtTEx8LEwsfMx8zFx8FBSoCeQcDWQEtDx8HBy8fJw8XGx8vFx8bJx8LGx9DJwJKFh8DAyHtHe/xAwMh6x1iA2YDAwN6AqoDHaoCrgIdzgLSAhVtAgIFMQUzBTUFNw0rIw8JQQEAAAAAAAAAAQAAAAAAAABAAAAAAAAAAIAAAAAAAAAAAwnaAqID3gKmA+ICTeYCTQU5AwMhVgMdeZoCAwO2AroCHb4CwgIdAgMGAx1aA14DBTsdbgJyAh1+AoICAwMhigIDA+4C8gId9gL6Ah0WAxoDHXkiAwMHg01uA3IDd3YDHX4DggMRDwEFPREPBR2OApICHZ4CogIRIwADAyHqAh1KA04DYWZmaW5lX21hcDwoZDAsIGQxLCBkMiwgZDMpIC0+IChkMCwgZDEsIGQyLCBkMyk+AAU/BUEFQwVFBUcjDwlBAQAAAAAAAAABAAAAAAAAAIAAAAAAAAAAgAAAAAAAAAAFSQVLBU0FTwVRBVMd9fcdBgIKAh0SAhYCBVUdNgI6AgVXBVkFWwMDIcoCAwMOAxIDFW0mAwVdAwMhegMFXwVhAwONjwVjEQ8tAxGTlROXmZudQ59DFaGj/aWnBWUBBfn5DSkFZyMPBSEQAAAAAAAAAIAAAAAAAAAABWkFawVtBW8FcQEXqa2xtbm9wcXJzdEDBRerGR0JVQMFF68ZHQlXAwUXsxkdCVkDBRe3GR0JWwMFF7sZXwldAwUXvxkdCWEDBRfDGV8JYwMFF8cZHQllAwUXyxkdCWcDBRfPGR0JaQMFF9MZHQlrAwUTGxVVAwUTGxVXAwUTGxVZAwUTGxVbAwUTGxVdAwUTGxVhAwUTGxVjAwUTGxVlAwUTGxVnAwUTGxVpAwUTGxVrEQEBEQUBBXMd8xEFdQV3LUUHsggXOSN0cHUuZGltZW5zaW9uX3NlbWFudGljczxhcmJpdHJhcnk+ACN0cHUubWVtb3J5X3NwYWNlPHZtZW0+ACN0cHUuY29yZV90eXBlPHRjPgAjdmVjdG9yLmtpbmQ8YWRkPgAVbw4CBXktRQn6CB/+CJUVcRoCBXstRQcGCR2TFR4CKgIdIgImAgV9LS8H8Rk9FS4CdR1zMgItLwe2CyGfBX8tLweaDQkVAwdCAkYCTgJSAndaAgWBAQVKAkMRD/0FgwEFR1YCEQ8CBAEFR0cdYgJmAgWFHWoCEQWHBYkddgIRBYsFjQWPHYYCEQWREwcBBZMdlgIRBZUdexEFlx2mAhEFmQWbHbICEQWdBZ8jDwUhAQAAAAAAAAAAAAAAAAAAAAWhHcYCEQWjJQsJAAAAAAWlHdYCEQWnBakFqwWtBa8TB9A8QW0PBbEjAQMJAQAAAAWzHf4CEQW1BbcdCgMRBbkFuxEPFQW9HR4DEQW/HXuBFW8qAxVxLgMVMgM+Ax02AzoDBcEtLwfHJ0sVQgN1HXNGAy0vCW4LJ4oLBwXDHVIDgQXFJQMJAAAAAAXHHYMRBckdagMRBcsFzSMBCSEBAAAAAQAAAAQAAAAAAAAAIwEBASURCQAAAAAFzx2GAxEF0QMFh/+JjgMjDwMRAQAAAAAAAAADBYf/iZYDIw8DEQAAAAAAAAAAAwMhngMTBxAAAOAPI3RwdS5kb3RfZGltZW5zaW9uX251bWJlcnM8WzFdLCBbMF0sIFswXSwgWzFdLCBbMCwgMCwgMSwgMV0sIFtdLCBbXT4AI3RwdS5jb250cmFjdF9wcmVjaXNpb248ZnAzMj4AI2FyaXRoLmZhc3RtYXRoPG5vbmU+AAECAicFAgICBAcDCxf7CQUFAgICBAdTJwUCAgICBycJBQUCAgIEBwECBCcDAgQHJwUFAgIBJwUCBAIEBxf7CQUFAgQCBAdTJwMCAgEnBQICAgIBJwUFAgQHJwkFBQIEAgQHJwUCBAICBwEJJwUCAgUBJwUCAgICIwUbAQEJCQkJFwkXCQkJCQEFBQEBCQEBAQEEvhwFAREBiwcDATELEQGRBwPWAm4FGwEBAQEJAQkBCQEJARcBCQEXAQkBCQEJAQkBAwMFAwMFAwMFAwMFAwMFAwMFAwMFAwMFDwYFAw0LBRsdHyEFBgUDAwMjAwMFAwMFAwMFAwMFAwMFAwMFAwMFAwMFDwYFAw0LBycpKy0FBgUDAwMvAwMFAwMFAwMFAwMFAwMFAwMFAwMFAwMFDwYFAw0LCTM1NzkFBgUDAwM7AwMFAwMFAwMFAwMFAwMFAwMFAwMFAwMFDwYFAw0LCz9BQ0UFBgUDAwNHAwMFAwMFAwMFAwMFAwMFAwMFAwMFAwMFDwYFAx8LDUtNT1EFBgUDFQNTAwMFAwMFAwMFAwMFAwMFAwMFAwMFAwMFDwYFAw0LD1dZW10FBgUDAwNfAwMFAwMFAwMFAwMFAwMFAwMFAwMFAwMFDwYFAx8LEWNlZ2kFBgUDFQNrJQdeAj4CAx0DSQUGMQMRA28XBzMLAwMDSQMDSTUDBwkGSQMDA3UdB0kLAwMFd0kXBzMLAwMDeQUGJQMdA3EJBksDAwN9HQdLCwMDBX9JFwczCwMDA4EHBw0LAwMFMXsHBw0LAwMFMYMHBw0LAwMFJXMTByknAyEDhQMDD30DCxEHDx8DCweJi40DAw1PAwcJBg0DCwORBwcNCwMLBY+TEwcpJwMhAz0DAw99AwsRBw8fAwsHYZeZAwMNTwMHCQYNAwsDnQcHDQsDCwWbnxkDOTcDEwUGMQMZA6MFBiUDJQOlGQM5NwMTBQYxAxkDqQUGJQMTA6sJBisDGwOnCQYrAxsDrSEHK38DJwWvsQMDOzUDBwkGPQMLA7UfBlEDCwezobcDAzs1AwcJBj0DCwO7HwZRAwsHs5W9EwcpJwMLA78DAw8jAwMRBw8fAwMHwWHDAwMPIwMDEQcPHwMDB4dtxxMHKScDFQNVAwMPIwMDEQcPHwMDB2HLzRMHKScDFQNtAwMPIwMDEQcPHwMDBz3R0wMDDyMDAxEHDx8DAwe5hdcTByknAwsDuQMDDyMDAxEHDx8DAwfbid0VBy0LAwMFxckDAwkDAwUDAwkDAwUDAwkDAwUDAwkDAwUPBgkDDQsX4+Xn6QUGCQMDA+sFBgkDDQPhGwUJPw3vF+Pl5+kHBw0LAwMF2XMDAw1PAwcJBg0DAwPzBwcNCwMDBfVzBwcNCwMDBc/3FQctCwMDBfH5AwMJAwMFAwMJAwMFAwMJAwMFAwMJAwMFDwYJAw0LE/3/AgIGAgUGCQMDAwoCBQYJAw0D+xsFCT8NEgIT/f8CAgYCBwcNCwMDBd97BwcNCwMDBdWDFQctCwMDBRYCGgIDAwkDAwUDAwkDAwUDAwkDAwUDAwkDAwUPBgkDDQsVIgImAioCLgIFBgkDAwMyAgUGCQMNAx4CGwUJPw06AhUiAiYCKgIuAhcHMwsDEQNxBwcNCwMVBVVtAwNBhQMRIwdBigMDEQVCAkYCBwcNCwMRBT4CSgIHBw0LAwMF1TEDA0GFAxEjB0GSAwMRBVICVgIVBy0LAxEFTgJaAgcHDQsDAwUl+wcHDQsDAwUxHgIdB0sLAwMFYgJmAhkDOTcDEwUGMQMZA24CBQYlAxMDcgIZAzk3AxMFBjEDGQN6AgUGJQMlA34CCQYrAxsDdgIJBisDGwOCAiEHK38DJwWGAooCAwM7mgMDBwMDOzUDBwkGPQMLA5ICCQY9AwsDlgIfBlEDCweOApoCngIDAw8jAwMRBw8fAwMHogJqAqYCBQYlAx0DXgIJBi0DAwOuAhUHLQsDAwWqArICAwMJAwMFAwMJAwMFAwMJAwMFAwMJAwMFDwYJAw0LGboCvgLCAsYCBQYJAwMDygIFBgkDDQO2AhsFCT8N0gIZugK+AsICxgINAAELEQHVBwMLEwUBAQEBAwMBBwMBAwMBBwMBAwMBBwMBDQQBCQEDBQcLEQHXBwMLEwUBAQEBAwMBBwMBAwMBBwMBAwMBBwMBDQQBCQEDBQcLEQHZBwMLEwUBAQEBAwMBBwMBAwMBBwMBAwMBBwMBDQQBCQEDBQcLEQHbBwMLEwUBAQEBAwMBBwMBAwMBBwMBAwMBBwMBDQQBCQEDBQcLEQHdBwMLEwUBAQEBAwMBBwMBAwMBBwMBAwMBBwMBDQQBCQEDBQcLEQHfBwMLEwUBAQEBAwMBBwMBAwMBBwMBAwMBBwMBDQQBCQEDBQcLEQHhBwMLEwUBAQEBAwMBBwMBAwMBBwMBAwMBBwMBDQQBCQEDBQcLEQHjBwMLEwUBAQEBAwMBBwMBAwMBBwMBAwMBBwMBDQQBCQEDBQcLEQHlBwMLEwUBAQEBAwMBBwMBAwMBBwMBAwMBBwMBDQQBCQEDBQcLEQHnBwMLEwUBAQEBAwMBBwMBAwMBBwMBAwMBBwMBDQQBCQEDBQcLEQHpBwMLEwUBAQEBAwMBBwMBAwMBBwMBAwMBBwMBDQQBCQEDBQcGAwEFAQCaFNMXGSkLDQsTFSUJCxUHCQsNFx0dFSUZGxUXGQkLCQsJCwkLExETDQ8NERMlJUcVCQsdHTkjISMpLR8LCSMlEQsbGRkZGRkZGRkZGRNZDR0lEx07LxcbFyMTExcdFxkZFSMXJR8PDw0JHRFidWlsdGluAHN0YWJsZV9tb3NhaWMAdHB1AGFyaXRoAHZlY3RvcgBtb2R1bGUAYXJpdGguY29uc3RhbnQAdmVjdG9yLnNoYXBlX2Nhc3QAYXJpdGgubXVsZgB2ZWN0b3IuYnJvYWRjYXN0AGZ1bmMuZnVuYwBmdW5jLnJldHVybgB2ZWN0b3IubG9hZAB0cHUubWF0bXVsAHRwdS50cmFuc3Bvc2UAYXJpdGguYWRkZgBtYXRoLmV4cAB0cHUuaW90YQB0cHUudmVjdG9yX3N0b3JlAGFyaXRoLnN1YmYAYXJpdGguc2VsZWN0AGFyaXRoLmNtcGkAdmVjdG9yLm11bHRpX3JlZHVjdGlvbgB2ZWN0b3IuZXh0cmFjdF9zdHJpZGVkX3NsaWNlAGZ1bmN0aW9uX3R5cGUAc3ltX25hbWUAdHJhbnNmb3JtX2luZGljZXMAd2luZG93X2JvdW5kcwB2YWx1ZQAvd29ya3NwYWNlL2tlcm5lbC1ldm9sdmUvZG9ja2VyL2V2YWx1YXRlLnB5ADxzdHJpbmc+AHRyYW5zZm9ybV8wAHRyYW5zZm9ybV8xAHRyYW5zZm9ybV8yAHRyYW5zZm9ybV8zAHRyYW5zZm9ybV80AHRyYW5zZm9ybV81AHRyYW5zZm9ybV82AHRyYW5zZm9ybV83AHRyYW5zZm9ybV84AHRyYW5zZm9ybV85AHRyYW5zZm9ybV8xMABtYWluAHN0cmlkZXMAYnJvYWRjYXN0X2luX2RpbToAYnJvYWRjYXN0X2luX2RpbQBhZGQAa2luZAByZWR1Y3Rpb25fZGltcwBzdGFibGVfbW9zYWljLnZlcnNpb24AZGltZW5zaW9uX3NlbWFudGljcwBpdGVyYXRpb25fYm91bmRzAHNjYWxhcl9wcmVmZXRjaABzY3JhdGNoX29wZXJhbmRzAF9jaHVua19nbGFfYndkX2Z1c2VkX2tlcm5lbAB0cHUuY29yZV90eXBlAHdpbmRvd19wYXJhbXMAZ2V0OgBnZXQAY2h1bmtfZ2xhAG9wdGltaXplZF9jb21wdXRlLjxsb2NhbHM+Lmxvc3NfZm4Ab3B0aW1pemVkX2NvbXB1dGUAc3RhZ2VfcGVyZm9ybWFuY2UAPG1vZHVsZT4Ab2Zmc2V0cwBzaXplcwBzbGljZToAc2xpY2UAc3F1ZWV6ZToAc3F1ZWV6ZQBmYXN0bWF0aABleHA6AGV4cABuZWc6AG5lZwBzdWI6AHN1YgBtdWw6AG11bABwZXJtdXRhdGlvbgB0cmFuc3Bvc2U6AHRyYW5zcG9zZQBkb3RfZ2VuZXJhbDoAZG90X2dlbmVyYWwAZGltZW5zaW9uX251bWJlcnMAcHJlY2lzaW9uAHRyYW5zcG9zZV9saHMAdHJhbnNwb3NlX3JocwBkaW1lbnNpb25zAGlvdGE6AGlvdGEAZ2U6AGdlAHByZWRpY2F0ZQBqaXQ6AGppdABzdGFnZV9jb3JyZWN0bmVzcwBzZWxlY3RfbjoAc2VsZWN0X24AYWRkOgBzd2FwOgBzd2FwAG9wZXJhbmRTZWdtZW50U2l6ZXMAcmVkdWNlX3N1bToAcmVkdWNlX3N1bQA=","needs_layout_passes":true,"allow_input_fusion":[],"serialization_format":"1","output_memory_colors":[],"output_memory_space_colors":[],"input_memory_space_colors":[],"disable_bounds_checks":true},"used_scoped_memory_configs":[{"memory_space":"1","offset":"0","size":"1605632"}],"retry_config":{"retry_count":"0"},"aliasing_operands":{"lists":[]}}
}

