HloModule jit_optimized_compute, is_scheduled=true, entry_computation_layout={()->f32[]{:T(128)}}, allow_spmd_sharding_propagation_to_output={true}

FileNames
1 "<string>"
2 "/workspace/kernel-evolve/docker/evaluate.py"

FunctionNames
1 "optimized_compute"
2 "_make_test_data"
3 "fused_chunk_fwd_kernel"
4 "<module>"
5 "main"
6 "stage_benchmark"
7 "optimized_compute.<locals>.loss_fn"
8 "fused_chunk_simple_gla"
9 "fused_chunk_simple_gla.<locals>._fwd"
10 "fused_chunk_simple_gla_fwd"
11 "fused_chunk_fwd"

FileLocations
1 {file_name_id=1 function_name_id=1 line=1049 end_line=1049 column=27 end_column=69}
2 {file_name_id=1 function_name_id=2 line=44 end_line=44 column=21 end_column=45}
3 {file_name_id=1 function_name_id=3 line=459 end_line=459 column=8 end_column=29}
4 {file_name_id=1 function_name_id=3 line=393 end_line=393 column=9 end_column=32}
5 {file_name_id=1 function_name_id=3 line=394 end_line=394 column=9 end_column=32}
6 {file_name_id=1 function_name_id=3 line=395 end_line=395 column=9 end_column=32}
7 {file_name_id=1 function_name_id=3 line=437 end_line=457 column=20 end_column=34}
8 {file_name_id=1 function_name_id=3 line=460 end_line=460 column=8 end_column=31}
9 {file_name_id=2 function_name_id=4 line=1107 end_line=1107 column=4 end_column=10}
10 {file_name_id=2 function_name_id=5 line=982 end_line=985 column=17 end_column=3}
11 {file_name_id=2 function_name_id=6 line=227 end_line=227 column=14 end_column=35}
12 {file_name_id=1 function_name_id=1 line=1058 end_line=1058 column=14 end_column=73}
13 {file_name_id=1 function_name_id=7 line=1056 end_line=1056 column=10 end_column=15}
14 {file_name_id=1 function_name_id=2 line=43 end_line=43 column=10 end_column=34}
15 {file_name_id=1 function_name_id=2 line=44 end_line=44 column=4 end_column=18}
16 {file_name_id=1 function_name_id=2 line=45 end_line=45 column=8 end_column=63}
17 {file_name_id=1 function_name_id=2 line=46 end_line=46 column=12 end_column=67}
18 {file_name_id=1 function_name_id=2 line=47 end_line=47 column=8 end_column=63}
19 {file_name_id=1 function_name_id=2 line=48 end_line=48 column=23 end_column=69}
20 {file_name_id=1 function_name_id=2 line=48 end_line=48 column=15 end_column=70}
21 {file_name_id=1 function_name_id=2 line=48 end_line=48 column=14 end_column=76}
22 {file_name_id=1 function_name_id=7 line=1054 end_line=1054 column=12 end_column=33}
23 {file_name_id=1 function_name_id=7 line=1054 end_line=1054 column=35 end_column=56}
24 {file_name_id=1 function_name_id=7 line=1055 end_line=1055 column=12 end_column=33}
25 {file_name_id=1 function_name_id=7 line=1053 end_line=1056 column=15 end_column=9}
26 {file_name_id=1 function_name_id=8 line=1040 end_line=1040 column=11 end_column=28}
27 {file_name_id=1 function_name_id=9 line=1013 end_line=1015 column=15 end_column=9}
28 {file_name_id=1 function_name_id=10 line=502 end_line=505 column=11 end_column=5}
29 {file_name_id=1 function_name_id=11 line=490 end_line=494 column=11 end_column=5}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=2}
3 {file_location_id=3 parent_frame_id=1}
4 {file_location_id=4 parent_frame_id=1}
5 {file_location_id=5 parent_frame_id=1}
6 {file_location_id=6 parent_frame_id=1}
7 {file_location_id=7 parent_frame_id=1}
8 {file_location_id=8 parent_frame_id=1}
9 {file_location_id=9 parent_frame_id=1}
10 {file_location_id=10 parent_frame_id=10}
11 {file_location_id=11 parent_frame_id=11}
12 {file_location_id=12 parent_frame_id=12}
13 {file_location_id=13 parent_frame_id=13}
14 {file_location_id=1 parent_frame_id=12}
15 {file_location_id=14 parent_frame_id=15}
16 {file_location_id=1 parent_frame_id=16}
17 {file_location_id=14 parent_frame_id=17}
18 {file_location_id=2 parent_frame_id=15}
19 {file_location_id=1 parent_frame_id=19}
20 {file_location_id=2 parent_frame_id=20}
21 {file_location_id=15 parent_frame_id=15}
22 {file_location_id=16 parent_frame_id=2}
23 {file_location_id=17 parent_frame_id=2}
24 {file_location_id=18 parent_frame_id=2}
25 {file_location_id=19 parent_frame_id=2}
26 {file_location_id=20 parent_frame_id=15}
27 {file_location_id=21 parent_frame_id=15}
28 {file_location_id=22 parent_frame_id=13}
29 {file_location_id=23 parent_frame_id=13}
30 {file_location_id=24 parent_frame_id=13}
31 {file_location_id=12 parent_frame_id=1}
32 {file_location_id=25 parent_frame_id=32}
33 {file_location_id=26 parent_frame_id=33}
34 {file_location_id=27 parent_frame_id=34}
35 {file_location_id=28 parent_frame_id=35}
36 {file_location_id=29 parent_frame_id=36}
37 {file_location_id=1 parent_frame_id=21}
38 {file_location_id=2 parent_frame_id=38}
39 {file_location_id=4 parent_frame_id=37}
40 {file_location_id=5 parent_frame_id=37}
41 {file_location_id=6 parent_frame_id=37}
42 {file_location_id=7 parent_frame_id=37}
43 {file_location_id=3 parent_frame_id=37}
44 {file_location_id=8 parent_frame_id=37}


%fused_computation.58 (param_0.664: u32[], param_1.871: u32[], param_2.828: u32[], param_3.794: u32[16], param_4.720: u32[4096], param_5.687: u32[10], param_6.721: u32[16], param_7.727: u32[4096], param_8.720: u32[10], param_9.728: u32[], param_10.748: u32[], param_11.758: u32[], param_12.766: u32[], param_13.772: u32[], param_14.810: u32[]) -> (f32[10,16,4096,128], f32[10,16,4096,128], f32[10,16,4096,128]) {
  %constant.684 = bf16[]{:T(256)} constant(-0.9961), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)" stack_frame_id=22}
  %max.17 = bf16[10,4096,16,128]{3,1,2,0:T(8,128)(2,1)} broadcast(%constant.684), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/max" stack_frame_id=22}
  %convert.18 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} convert(%max.17)
  %param_8.720 = u32[10]{0:T(128)S(1)} parameter(8)
  %broadcast.1279 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%param_8.720), dimensions={0}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %param_7.727 = u32[4096]{0:T(1024)S(1)} parameter(7)
  %broadcast.1278 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%param_7.727), dimensions={1}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %add.1460 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%broadcast.1279, %broadcast.1278), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %param_6.721 = u32[16]{0:T(128)S(1)} parameter(6)
  %broadcast.1277 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%param_6.721), dimensions={2}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %add.1459 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1460, %broadcast.1277), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %iota.51 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} iota(), iota_dimension=3, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %add.1458 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1459, %iota.51), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %compare.74 = pred[10,4096,16,128]{3,1,2,0:T(8,128)(4,1)} compare(%add.1458, %add.1459), direction=LT, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %compare.73 = pred[10,4096,16,128]{3,1,2,0:T(8,128)(4,1)} compare(%add.1459, %add.1460), direction=LT, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %compare.72 = pred[10,4096,16,128]{3,1,2,0:T(8,128)(4,1)} compare(%add.1460, %broadcast.1279), direction=LT, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %param_5.687 = u32[10]{0:T(128)S(1)} parameter(5)
  %broadcast.1276 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%param_5.687), dimensions={0}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %param_4.720 = u32[4096]{0:T(1024)S(1)} parameter(4)
  %broadcast.1275 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%param_4.720), dimensions={1}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %add.1457 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%broadcast.1276, %broadcast.1275), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %constant.850 = u32[]{:T(128)} constant(1), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %broadcast.1274 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.850), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %add.1456 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1457, %broadcast.1274), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %select.84 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} select(%compare.72, %add.1456, %add.1457), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %param_3.794 = u32[16]{0:T(128)S(1)} parameter(3)
  %broadcast.1273 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%param_3.794), dimensions={2}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %add.1455 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%select.84, %broadcast.1273), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %add.1454 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1455, %broadcast.1274), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %select.83 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} select(%compare.73, %add.1454, %add.1455), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %add.1453 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%select.83, %broadcast.1274), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %select.82 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} select(%compare.74, %add.1453, %select.83), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %constant.667 = u32[]{:T(128)} constant(0), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %broadcast.1272 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.667), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %shift-right-logical.112 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%select.82, %broadcast.1272), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %param_2.828 = u32[]{:T(128)} parameter(2)
  %add.1452 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%param_2.828), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1451 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%shift-right-logical.112, %add.1452), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %param_1.871 = u32[]{:T(128)} parameter(1)
  %add.1450 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%param_1.871), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1449 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1458, %add.1450), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1448 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1451, %add.1449), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %constant.883 = u32[]{:T(128)} constant(13), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %broadcast.1271 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.883), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %shift_left.555 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%add.1449, %broadcast.1271), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %constant.877 = u32[]{:T(128)} constant(19), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %broadcast.1270 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.877), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %shift_right_logical.572 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%add.1449, %broadcast.1270), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.592 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.555, %shift_right_logical.572), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.587 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1448, %or.592), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1447 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1448, %xor.587), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %constant.873 = u32[]{:T(128)} constant(15), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %broadcast.1269 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.873), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %shift_left.554 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.587, %broadcast.1269), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %constant.867 = u32[]{:T(128)} constant(17), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %broadcast.1268 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.867), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %shift_right_logical.571 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.587, %broadcast.1268), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.591 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.554, %shift_right_logical.571), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.586 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1447, %or.591), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1446 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1447, %xor.586), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %constant.861 = u32[]{:T(128)} constant(26), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %broadcast.1267 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.861), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %shift_left.553 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.586, %broadcast.1267), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %constant.855 = u32[]{:T(128)} constant(6), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %broadcast.1266 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.855), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %shift_right_logical.570 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.586, %broadcast.1266), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.590 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.553, %shift_right_logical.570), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.585 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1446, %or.590), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1445 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1446, %xor.585), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1444 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1445, %add.1450), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.552 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.585, %broadcast.1266), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.569 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.585, %broadcast.1267), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.589 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.552, %shift_right_logical.569), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.584 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1445, %or.589), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %param_0.664 = u32[]{:T(128)S(6)} parameter(0)
  %add.1443 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%param_0.664), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1442 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%xor.584, %add.1443), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1441 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1442, %broadcast.1274), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1440 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1444, %add.1441), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.551 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%add.1441, %broadcast.1268), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.568 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%add.1441, %broadcast.1269), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.588 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.551, %shift_right_logical.568), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.583 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1440, %or.588), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1439 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1440, %xor.583), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %constant.844 = u32[]{:T(128)} constant(29), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %broadcast.1265 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.844), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %shift_left.550 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.583, %broadcast.1265), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %constant.837 = u32[]{:T(128)} constant(3), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %broadcast.1264 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.837), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %shift_right_logical.567 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.583, %broadcast.1264), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.587 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.550, %shift_right_logical.567), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.582 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1439, %or.587), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1438 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1439, %xor.582), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %constant.829 = u32[]{:T(128)} constant(16), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %broadcast.1263 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.829), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/iota_2x32_shape" stack_frame_id=22}
  %shift_left.549 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.582, %broadcast.1263), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.566 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.582, %broadcast.1263), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.586 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.549, %shift_right_logical.566), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.581 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1438, %or.586), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1437 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1438, %xor.581), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1436 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1437, %add.1443), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %constant.820 = u32[]{:T(128)} constant(24), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %broadcast.1262 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.820), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %shift_left.548 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.581, %broadcast.1262), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %constant.814 = u32[]{:T(128)} constant(8), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %broadcast.1261 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.814), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %shift_right_logical.565 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.581, %broadcast.1261), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.585 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.548, %shift_right_logical.565), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.580 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1437, %or.585), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1435 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%xor.580, %add.1452), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %constant.808 = u32[]{:T(128)} constant(2), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %add.1434 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.808), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=22}
  %add.1433 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1435, %add.1434), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1432 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1436, %add.1433), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.547 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%add.1433, %broadcast.1271), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.564 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%add.1433, %broadcast.1270), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.584 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.547, %shift_right_logical.564), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.579 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1432, %or.584), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1431 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1432, %xor.579), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.546 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.579, %broadcast.1269), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.563 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.579, %broadcast.1268), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.583 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.546, %shift_right_logical.563), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.578 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1431, %or.583), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1430 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1431, %xor.578), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.545 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.578, %broadcast.1267), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.562 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.578, %broadcast.1266), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.582 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.545, %shift_right_logical.562), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.577 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1430, %or.582), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1429 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1430, %xor.577), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1428 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1429, %add.1452), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.544 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.577, %broadcast.1266), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.561 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.577, %broadcast.1267), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.581 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.544, %shift_right_logical.561), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.576 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1429, %or.581), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1427 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%xor.576, %add.1450), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1426 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1427, %broadcast.1264), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1425 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1428, %add.1426), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.543 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%add.1426, %broadcast.1268), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.560 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%add.1426, %broadcast.1269), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.580 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.543, %shift_right_logical.560), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.575 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1425, %or.580), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1424 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1425, %xor.575), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.542 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.575, %broadcast.1265), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.559 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.575, %broadcast.1264), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.579 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.542, %shift_right_logical.559), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.574 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1424, %or.579), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1423 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1424, %xor.574), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.541 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.574, %broadcast.1263), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.558 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.574, %broadcast.1263), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.578 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.541, %shift_right_logical.558), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.573 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1423, %or.578), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1422 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1423, %xor.573), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1421 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1422, %add.1450), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.540 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.573, %broadcast.1262), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.557 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.573, %broadcast.1261), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.577 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.540, %shift_right_logical.557), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.572 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1422, %or.577), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1420 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%xor.572, %add.1443), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %constant.803 = u32[]{:T(128)} constant(4), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %add.1419 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.803), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=22}
  %add.1418 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1420, %add.1419), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1417 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1421, %add.1418), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.539 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%add.1418, %broadcast.1271), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.556 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%add.1418, %broadcast.1270), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.576 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.539, %shift_right_logical.556), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.571 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1417, %or.576), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1416 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1417, %xor.571), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.538 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.571, %broadcast.1269), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.555 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.571, %broadcast.1268), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.575 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.538, %shift_right_logical.555), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.570 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1416, %or.575), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1415 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1416, %xor.570), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.537 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.570, %broadcast.1267), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.554 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.570, %broadcast.1266), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.574 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.537, %shift_right_logical.554), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.569 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1415, %or.574), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1414 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1415, %xor.569), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %add.1413 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1414, %add.1443), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %shift_left.536 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-left(%xor.569, %broadcast.1266), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_left" stack_frame_id=24}
  %shift_right_logical.553 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} shift-right-logical(%xor.569, %broadcast.1267), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %or.573 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} or(%shift_left.536, %shift_right_logical.553), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %xor.568 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1414, %or.573), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %add.1412 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%xor.568, %add.1452), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %constant.798 = u32[]{:T(128)} constant(5), metadata={op_name="jit(optimized_compute)/jit(_threefry_split)/_make_test_data" stack_frame_id=38}
  %add.1411 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.798), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=22}
  %add.1410 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%add.1412, %add.1411), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}
  %xor.567 = u32[10,4096,16,128]{3,1,2,0:T(8,128)} xor(%add.1413, %add.1410), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/xor" stack_frame_id=24}
  %convert_element_type.27 = u8[10,4096,16,128]{3,1,2,0:T(8,128)(4,1)} convert(%xor.567), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/convert_element_type" stack_frame_id=24}
  %convert_element_type.19 = u16[10,4096,16,128]{3,1,2,0:T(8,128)(2,1)} convert(%convert_element_type.27), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/convert_element_type" stack_frame_id=24}
  %constant.665 = u16[]{:T(256)} constant(1), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %shift_right_logical.573 = u16[10,4096,16,128]{3,1,2,0:T(8,128)(2,1)} broadcast(%constant.665), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=22}
  %shift_right_logical.450 = u16[10,4096,16,128]{3,1,2,0:T(8,128)(2,1)} shift-right-logical(%convert_element_type.19, %shift_right_logical.573), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/shift_right_logical" stack_frame_id=24}
  %constant.662 = u16[]{:T(256)} constant(16256), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %or.593 = u16[10,4096,16,128]{3,1,2,0:T(8,128)(2,1)} broadcast(%constant.662), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=22}
  %or.470 = u16[10,4096,16,128]{3,1,2,0:T(8,128)(2,1)} or(%shift_right_logical.450, %or.593), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/or" stack_frame_id=24}
  %bitcast_convert_type.7 = bf16[10,4096,16,128]{3,1,2,0:T(8,128)(2,1)} bitcast-convert(%or.470), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/bitcast_convert_type" stack_frame_id=24}
  %convert.15 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} convert(%bitcast_convert_type.7)
  %constant.659 = bf16[]{:T(256)} constant(-1), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %broadcast.1280 = bf16[10,4096,16,128]{3,1,2,0:T(8,128)(2,1)} broadcast(%constant.659), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=22}
  %convert.16 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} convert(%broadcast.1280)
  %add.1084 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%convert.15, %convert.16), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/sub" stack_frame_id=24}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"float_type_correction_info":{"original_type":"BF16","original_shape":{"element_type":"BF16","dimensions":["10","4096","16","128"],"tuple_shapes":[],"layout":{"minor_to_major":["3","1","2","0"],"tiles":[{"dimensions":["8","128"]},{"dimensions":["2","1"]}],"element_size_in_bits":"0","memory_space":"0","dim_level_types":[],"index_primitive_type":"PRIMITIVE_TYPE_INVALID","pointer_primitive_type":"PRIMITIVE_TYPE_INVALID","dim_unique":[],"dim_ordered":[],"dynamic_shape_metadata_prefix_bytes":"0","tail_padding_alignment_in_elements":"1","split_configs":[]},"is_dynamic_dimension":[false,false,false,false]}}}
  %constant.656 = bf16[]{:T(256)} constant(2), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/mul" stack_frame_id=22}
  %mul.51 = bf16[10,4096,16,128]{3,1,2,0:T(8,128)(2,1)} broadcast(%constant.656), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/mul" stack_frame_id=22}
  %convert.17 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} convert(%mul.51)
  %mul.45 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} multiply(%add.1084, %convert.17), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/mul" stack_frame_id=24}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"float_type_correction_info":{"original_type":"BF16","original_shape":{"element_type":"BF16","dimensions":["10","4096","16","128"],"tuple_shapes":[],"layout":{"minor_to_major":["3","1","2","0"],"tiles":[{"dimensions":["8","128"]},{"dimensions":["2","1"]}],"element_size_in_bits":"0","memory_space":"0","dim_level_types":[],"index_primitive_type":"PRIMITIVE_TYPE_INVALID","pointer_primitive_type":"PRIMITIVE_TYPE_INVALID","dim_unique":[],"dim_ordered":[],"dynamic_shape_metadata_prefix_bytes":"0","tail_padding_alignment_in_elements":"1","split_configs":[]},"is_dynamic_dimension":[false,false,false,false]}}}
  %add.1083 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} add(%mul.45, %convert.18), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/add" stack_frame_id=24}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"float_type_correction_info":{"original_type":"BF16","original_shape":{"element_type":"BF16","dimensions":["10","4096","16","128"],"tuple_shapes":[],"layout":{"minor_to_major":["3","1","2","0"],"tiles":[{"dimensions":["8","128"]},{"dimensions":["2","1"]}],"element_size_in_bits":"0","memory_space":"0","dim_level_types":[],"index_primitive_type":"PRIMITIVE_TYPE_INVALID","pointer_primitive_type":"PRIMITIVE_TYPE_INVALID","dim_unique":[],"dim_ordered":[],"dynamic_shape_metadata_prefix_bytes":"0","tail_padding_alignment_in_elements":"1","split_configs":[]},"is_dynamic_dimension":[false,false,false,false]}}}
  %max.14 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} maximum(%convert.18, %add.1083), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)/max" stack_frame_id=24}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"float_type_correction_info":{"original_type":"BF16","original_shape":{"element_type":"BF16","dimensions":["10","4096","16","128"],"tuple_shapes":[],"layout":{"minor_to_major":["3","1","2","0"],"tiles":[{"dimensions":["8","128"]},{"dimensions":["2","1"]}],"element_size_in_bits":"0","memory_space":"0","dim_level_types":[],"index_primitive_type":"PRIMITIVE_TYPE_INVALID","pointer_primitive_type":"PRIMITIVE_TYPE_INVALID","dim_unique":[],"dim_ordered":[],"dynamic_shape_metadata_prefix_bytes":"0","tail_padding_alignment_in_elements":"1","split_configs":[]},"is_dynamic_dimension":[false,false,false,false]}}}
  %erf_inv.1083 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} convert(%max.14), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/erf_inv" stack_frame_id=24}
  %erf_inv.1082 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} abs(%erf_inv.1083), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/erf_inv" stack_frame_id=24}
  %constant.791 = f32[]{:T(128)} constant(1), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/jit(_uniform)" stack_frame_id=25}
  %erf_inv.1456 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.791), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/erf_inv" stack_frame_id=22}
  %erf_inv.1081 = pred[10,4096,16,128]{3,1,2,0:T(8,128)(4,1)} compare(%erf_inv.1082, %erf_inv.1456), direction=EQ, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/erf_inv" stack_frame_id=24}
  %constant.787 = f32[]{:T(128)} constant(inf), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)" stack_frame_id=25}
  %erf_inv.1453 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} broadcast(%constant.787), dimensions={}, metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/erf_inv" stack_frame_id=22}
  %erf_inv.1080 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} multiply(%erf_inv.1083, %erf_inv.1453), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/erf_inv" stack_frame_id=24}
  %erf_inv.1079 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} negate(%erf_inv.1083), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/erf_inv" stack_frame_id=24}
  %erf_inv.1078 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} multiply(%erf_inv.1083, %erf_inv.1079), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/erf_inv" stack_frame_id=24}
  %erf_inv.1077 = f32[10,4096,16,128]{3,1,2,0:T(8,128)} log-plus-one(%erf_inv.1078), metadata={op_name="jit(optimized_compute)/jit(_normal)/jit(_normal_real)/erf_inv" stack_frame_id=24}
